CSI API ETABS v1

# cPropPointSpring Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cPropPointSpring

    Public Interface cPropPointSpring

    Dim instance As cPropPointSpring

    public interface class cPropPointSpring

    type cPropPointSpring =  interface end

The cPropPointSpring type exposes the following members.

Methods

| Name| Description
---|---|---
|
ChangeName|  Changes the name of a
defined point spring property
|
Delete|  Deletes the specified
point spring property
|
GetLinks|  Retrieves the single
joint links for a named point spring property
|
GetNameList|  Retrieves the names
of all defined point spring property
|
GetPointSpringProp|  Retrieves an
existing named point spring property
|
SetLinks|  Sets single joint links
for a named point spring property
|
SetPointSpringProp|  Creates a new
named point spring property, or modifies an existing named point spring
property
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com